toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static void USBD_SetFeature(const Toastbox::USB::SetupRequest& req) {
        AssertLED(false);
//    if (req.wValue == USB_FEATURE_REMOTE_WAKEUP)
//    {
//    _Device.dev_remote_wakeup = 1U;
//    _CmdAccept(true);
//    }
    }


    static void USBD_ClrFeature(const Toastbox::USB::SetupRequest& req) {
        AssertLED(false);
//        switch (_Device.dev_state) {
//        case USBD_STATE_DEFAULT:
//        case USBD_STATE_ADDRESSED:
//        case USBD_STATE_CONFIGURED:
//            if (req.wValue == USB_FEATURE_REMOTE_WAKEUP) {
//                _Device.dev_remote_wakeup = 0U;
//                return _CmdAccept(true);
//            }
//            break;
//        }
//        _CmdAccept(false);
    }

    static void USBD_StdDevReq(const Toastbox::USB::SetupRequest& req) {
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_CLASS:
            return USBD_MSC_Setup(req);
//        case USB_REQ_TYPE_VENDOR:
//            _CmdAccept(false);
//            break;
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_DESCRIPTOR:    return USBD_GetDescriptor(req);
            case USB_REQ_SET_ADDRESS:       return USBD_SetAddress(req);
            case USB_REQ_SET_CONFIGURATION: return USBD_SetConfig(req);
            case USB_REQ_GET_CONFIGURATION: return USBD_GetConfig(req);
            case USB_REQ_GET_STATUS:        return USBD_GetStatus(req);
            case USB_REQ_SET_FEATURE:       return USBD_SetFeature(req);
            case USB_REQ_CLEAR_FEATURE:     return USBD_ClrFeature(req);
            default:                        break;
            }
        }}
        _CmdAccept(false);
    }
    
    static void USBD_StdItfReq(const Toastbox::USB::SetupRequest& req) {
        const uint8_t status[2] = {};
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_STATUS:
                Send(0x80, status, sizeof(status));
                Recv(0x00, nullptr, 0);
                return;
                
            case USB_REQ_CLEAR_FEATURE:     AssertLED(false);
            case USB_REQ_SET_FEATURE:       AssertLED(false);
            case USB_REQ_GET_INTERFACE:     AssertLED(false);
            case USB_REQ_SET_INTERFACE:     AssertLED(false);
            default:                        break;
            }
            break;
        }}
        _CmdAccept(false);
    }

    static void USBD_StdEPReq(const Toastbox::USB::SetupRequest& req) {
        const uint8_t status[2] = {};
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_STATUS:
                Send(0x80, status, sizeof(status));
                Recv(0x00, nullptr, 0);
                return;
                
            case USB_REQ_CLEAR_FEATURE:
                if (req.wValue == USB_FEATURE_EP_HALT) {
                    return _CmdAccept(true);
                } else {
                    AssertLED(false);
                }
                
            case USB_REQ_SET_FEATURE:       AssertLED(false);
            case USB_REQ_GET_INTERFACE:     AssertLED(false);
            case USB_REQ_SET_INTERFACE:     AssertLED(false);
            default:                        break;
            }
            break;
        }}
        _CmdAccept(false);
        
        
        
//        AssertLED(false);
        
//        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_STANDARD: {
//            switch (req.bRequest) {
//            case USB_REQ_GET_STATUS:        AssertLED(false);
//            case USB_REQ_CLEAR_FEATURE:     AssertLED(false);
//            case USB_REQ_SET_FEATURE:       AssertLED(false);
//            case USB_REQ_GET_INTERFACE:     AssertLED(false);
//            case USB_REQ_SET_INTERFACE:     AssertLED(false);
//            default:                        break;
//            }
//            break;
//        }}
//        _CmdAccept(false);
        
        
//        AssertLED(false);
//        USBD_EndpointTypeDef *pep;
//        uint8_t ep_addr;
//        USBD_StatusTypeDef ret = USBD_OK;
//        ep_addr = LOBYTE(req.wIndex);
//        
//        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_STANDARD:
//            switch (req.bRequest) {
//            case USB_REQ_SET_FEATURE:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        (void)USBD_LL_StallEP(pdev, ep_addr);
//                        (void)USBD_LL_StallEP(pdev, 0x80U);
//                        return;
//                    }
//                
//                case USBD_STATE_CONFIGURED:
//                    if (req.wValue == USB_FEATURE_EP_HALT) {
//                        if ((ep_addr != 0x00U) && (ep_addr != 0x80U) && (req.wLength == 0x00U)) {
//                            USBD_LL_StallEP(pdev, ep_addr);
//                            return;
//                        }
//                    }
//                    return _CmdAccept(true);
//                }
//            
//            case USB_REQ_CLEAR_FEATURE:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        (void)USBD_LL_StallEP(pdev, ep_addr);
//                        (void)USBD_LL_StallEP(pdev, 0x80U);
//                    
//                    } else {
//                        _CmdAccept(false);
//                    }
//                    break;
//                case USBD_STATE_CONFIGURED:
//                    if (req.wValue == USB_FEATURE_EP_HALT) {
//                        if ((ep_addr & 0x7FU) != 0x00U) {
//                            (void)USBD_LL_ClearStallEP(pdev, ep_addr);
//                        }
//                        _CmdAccept(true);
//                        AssertLED(false);
//                    //              (USBD_StatusTypeDef)pdev->pClass->Setup(pdev, req);
//                    }
//                    break;
//                default:
//                    _CmdAccept(false);
//                    break;
//                }
//                break;
//
//            case USB_REQ_GET_STATUS:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        _CmdAccept(false);
//                        break;
//                    }
//                    
//                    pep = ((ep_addr & 0x80U) == 0x80U) ? &pdev->ep_in[ep_addr & 0x7FU] : \
//                    &pdev->ep_out[ep_addr & 0x7FU];
//                    pep->status = 0x0000U;
//
//                    Send(0x80, (uint8_t*)&pep->status, 2);
//                    AssertLED(false);
//                    break;
//                
//                case USBD_STATE_CONFIGURED:
//                    if ((ep_addr & 0x80U) == 0x80U) {
//                        if (pdev->ep_in[ep_addr & 0xFU].is_used == 0U) {
//                            _CmdAccept(false);
//                            break;
//                        }
//                    } else {
//                        if (pdev->ep_out[ep_addr & 0xFU].is_used == 0U) {
//                            _CmdAccept(false);
//                            break;
//                        }
//                    }
//                    
//                    pep = ((ep_addr & 0x80U) == 0x80U) ? &pdev->ep_in[ep_addr & 0x7FU] : \
//                    &pdev->ep_out[ep_addr & 0x7FU];
//                    
//                    if ((ep_addr == 0x00U) || (ep_addr == 0x80U)) {
//                        pep->status = 0x0000U;
//                    } else if (USBD_LL_IsStallEP(pdev, ep_addr) != 0U) {
//                        pep->status = 0x0001U;
//                    } else {
//                        pep->status = 0x0000U;
//                    }
//                    
//                    Send(0x80, (uint8_t*)&pep->status, 2);
//                    AssertLED(false);
//                    break;
//                
//                default:
//                    _CmdAccept(false);
//                    break;
//                }
//                break;
//
//            default:
//                _CmdAccept(false);
//                break;
//            }
//            break;
//        
//        default:
//            _CmdAccept(false);
//            break;
//        }
//
//        return ret;
//        
//        _CmdAccept(false);
    }

    static void _SetupRequestHandle(const Toastbox::USB::SetupRequest& req) {
        switch (req.bmRequestType & Toastbox::USB::RequestType::RecipientMask) {
        case USB_REQ_RECIPIENT_DEVICE:    return USBD_StdDevReq(req);
        case USB_REQ_RECIPIENT_INTERFACE: return USBD_StdItfReq(req);
        case USB_REQ_RECIPIENT_ENDPOINT:  return USBD_StdEPReq(req);
        }
        _CmdAccept(false);
    }
    
    struct [[gnu::packed]] CBW {
        uint32_t dSignature;
        uint32_t dTag;
        uint32_t dDataLength;
        uint8_t  bmFlags;
        uint8_t  bLUN;
        uint8_t  bCBLength;
        uint8_t  CB[16];
    };
    
    struct [[gnu::packed]] CSW {
        uint32_t dSignature;
        uint32_t dTag;
        uint32_t dDataResidue;
        uint8_t  bStatus;
    };
    
